{
    "Arfordir": "A rugged coastal nation of skilled sailors and shipwrights, whose people are as hardy as the cliffs they live on.",
    "Blū": "A serene, isolated nation built around a massive, magically infused forest. Its people are deeply connected to nature.",
    "The Confederated State of the Half Heights": "A land of rolling hills and stout-hearted halflings, known for its agriculture and fierce defense of its borders.",
    "Farnear": "A bustling trade hub where cultures collide, famous for its sprawling markets and valuable exports.",
    "Fearledell": "An ancient, elven kingdom hidden within a misty valley, protective of its traditions and magical secrets.",
    "Fook & Took": "Twin cities on opposite sides of a river, locked in a friendly but intense economic and cultural rivalry.",
    "Haroldford": "A stoic, northern kingdom of dwarves, masters of smithing and stonework, with halls carved deep into the mountains.",
    "Icebeach": "A harsh, frozen landscape where nomadic tribes hunt massive beasts and survive against the biting cold.",
    "The Iron Bash": "A militaristic state dominated by orcs and goblinoids, where strength is law and conquest is a way of life.",
    "The Province of Southern Fair": "A sun-drenched land of artists, poets, and philosophers, celebrated for its beauty and cultural achievements.",
    "RoswiN": "A land of chivalrous knights and towering castles, where honor and duty are the highest virtues.",
    "The Sovereign Island Nation of Relèv": "An elegant island nation of high elves, known for its powerful navy and mastery of arcane arts.",
    "Bec": "The heart of the Beccin Empire, a heavily fortified capital city that projects imperial power across the continent.",
    "Goldwind": "A fertile province known as the breadbasket of the Empire, its fields stretching as far as the eye can see.",
    "Last Elven State": "A conquered elven kingdom now under Imperial rule, its people simmering with resentment and clinging to their lost glory.",
    "Mt. Egma": "A volcanic mountain fortress where the Empire forges its finest weapons and trains its elite soldiers.",
    "Astrousian City-State": "A generic term for one of the many independent, fortified cities that dot the dangerous jungles of Astrousia.",
    "Athenium": "The capital of magic, a city built on floating islands and powered by immense arcane energies.",
    "Frozen North": "The unforgiving arctic wasteland, home to hardy survivalists and creatures of ice and snow.",
    "Naga": "A swampy, marsh-filled land inhabited by the serpentine Naga, rich with ancient secrets and potent venoms.",
    "Oldlin": "A land of ancient forests and druidic circles, where the old ways of nature are still practiced.",
    "Random Island": "One of the countless uncharted islands in the vast ocean, potentially holding anything from treasure to unspeakable horrors.",
    "Wolgari": "A massive, bureaucratic nation of kobolds, where everything is managed through a complex and often absurd system of rules and forms.",
    "Nutsten": "A bustling Astrousian city carved into the side of a giant, petrified tree.",
    "Tooliken": "A town known for its ingenious clockwork inventions and automatons.",
    "Unlik": "A remote town that serves as a last stop for adventurers heading into the deepest parts of the jungle.",
    "Walkers": "A nomadic town built on the backs of colossal, slow-moving beasts.",
    "Jungle": "A small, isolated village struggling to survive in the perilous Astrousian wilds.",
    "Delphi": "The dazzling heart of Athenium, a city of soaring towers and magical wonders.",
    "Delphi Suburb": "The residential districts surrounding Delphi, where mages and artisans live in magically-crafted homes.",
    "Northern City": "An Athenium city focused on the study of elemental magic, built near a convergence of ley lines.",
    "Southern City": "An Athenium city dedicated to illusion and enchantment, famous for its magical arts and theater.",
    "Small Village": "A tiny, struggling settlement in the Frozen North, huddled together for warmth and protection.",
    "Wandering Tribe": "A nomadic group that follows the migrating herds across the frozen tundra.",
    "Fhoe": "A Naga village built on stilts above the murky swamp waters.",
    "Lucinders": "A Naga town that trades in rare herbs and alchemical reagents found in the surrounding marshes.",
    "No Beard": "A major Naga city, so named because its founders shaved the beards of defeated dwarven invaders.",
    "Wingate": "A fortified Naga city that guards the entrance to their territory.",
    "Goldstone": "An Oldlin town centered around a sacred, glowing stone that is the focus of druidic rituals.",
    "Grey Sisters": "A quiet Oldlin village nestled between three ancient, moss-covered hills.",
    "Knoll": "A town built atop a large, defensible hill, offering a clear view of the surrounding forest.",
    "Nort": "An Oldlin logging town that has a tense relationship with the forest's guardians.",
    "Attergo": "A major port city in Arfordir, its harbor filled with ships from across the world.",
    "Crystal Cove": "A town in Arfordir famous for the beautiful, naturally-formed crystals found in its sea caves.",
    "Gelwood": "An Arfordir village known for its unique, jelly-like trees that are harvested for food and alchemical ingredients.",
    "Rockdrift": "A city in Arfordir built on a series of interconnected, rocky islands.",
    "Fook": "The industrial heart of the twin cities, known for its foundries and workshops.",
    "Took": "The cultural center of the twin cities, famous for its arts, cuisine, and lively festivals.",
    "Casgate": "An Icebeach village that guards a crucial pass through the mountains.",
    "Flamore": "An Icebeach village built around a series of natural hot springs, providing a rare source of warmth.",
    "The Fractured Point": "The largest settlement in Icebeach, a city built on a peninsula of shattered, icy cliffs.",
    "Winterhold Keep": "A solitary fortress that stands against the endless snows of Icebeach."
}
