[
    { "range": [1,1], "text": "Your parents were murdered. Gain proficiency in Stealth and Survival." },
    { "range": [2,2], "text": "You found a dying dark elf who gave you an amulet of proof against detection and location." },
    { "range": [3,3], "text": "A mysterious stranger gave you a permanent magic item (from DMG table B)." },
    { "range": [4,4], "text": "You survived a magical storm and now have prophetic dreams. Gain proficiency in Arcana or Religion." },
    { "range": [5,5], "text": "A famous warrior trained you. Gain proficiency with a martial weapon of your choice, a special version of it, and the Martial Adept feat." },
    { "range": [6,6], "text": "You were the sole survivor of a monster raid on your home. Gain proficiency in Stealth or with martial weapons." },
    { "range": [7,7], "text": "A famous mage tutored you. You have a spellbook and the Magic Initiate feat." },
    { "range": [8,8], "text": "You spent a year with a traveling circus. Gain proficiency in Acrobatics or Performance and with the disguise kit." },
    { "range": [9,9], "text": "You were transformed into a bear for a year. You can cast Speak with Animals at will." },
    { "range": [10,10], "text": "You were press-ganged into military service. Gain proficiency with medium armor, shields, and martial weapons, but suffer from indefinite madness." },
    { "range": [11,11], "text": "Kidnapped by bandits, you escaped with the help of an old thief. Gain proficiency with thieves' tools and in Stealth." },
    { "range": [12,12], "text": "A demon lord visited your dream. You can cast Find Familiar (as a quasit) but suffer from indefinite madness." },
    { "range": [13,13], "text": "You were attacked by evil lycanthropes and are now cursed with lycanthropy (DM's choice)." },
    { "range": [14,14], "text": "You were saved by a good lycanthrope and given the gift of lycanthropy with your consent." },
    { "range": [15,15], "text": "You saved a pseudodragon, which now loyally follows you." },
    { "range": [16,16], "text": "You nearly died from a disease, but were given a periapt of health to suppress it." },
    { "range": [17,17], "text": "You were exiled or imprisoned. Gain proficiency in Intimidation and you know thieves' cant." },
    { "range": [18,18], "text": "You saved a lost horse. You own a riding horse and saddle, and have proficiency in Animal Handling." },
    { "range": [19,19], "text": "You found a treasure map in a mysterious tome." },
    { "range": [20,20], "text": "A letter revealed you are the secret child of a noble family. You have 100gp and a signet ring." },
    { "range": [21,21], "text": "You met circus performers and were gifted a common magic item (Snugglebeat). Gain proficiency in Performance." },
    { "range": [22,22], "text": "Blessed by a minor deity for your bravery. Gain proficiency with shields OR learn the Shield spell (1/long rest)." },
    { "range": [23,23], "text": "A parent disappeared, leaving a note and a +1 longsword. You have proficiency with longswords." },
    { "range": [24,24], "text": "You survived a magical storm. Gain the Elemental Adept feat and a damage cantrip (Con-based)." },
    { "range": [25,25], "text": "An archdevil spoke to you in a dream. You can cast Find Familiar (as an imp) but suffer from indefinite madness." },
    { "range": [26,26], "text": "You survived a deadly fall and were visited by a goddess. Gain proficiency in Arcana and Religion." },
    { "range": [27,27], "text": "You touched a giant's runestone and can now cast Enlarge/Reduce (enlarge only) once per day." },
    { "range": [28,28], "text": "A horde of monsters attacked your home. You gain the Alert feat." },
    { "range": [29,29], "text": "You survived for years in a monster-infested dungeon. You gain the Dungeon Delver feat." },
    { "range": [30,30], "text": "You escaped slavery from drow/duergar. You gain the Actor feat and proficiency with disguise kits." },
    { "range": [31,31], "text": "You unwittingly earned a cult's favor and were given 1,000 gp to deliver to a secret shrine." },
    { "range": [32,32], "text": "A master horse trainer mentored you. You have proficiency in Animal Handling and a warhorse." },
    { "range": [33,33], "text": "In a fit of rage, you killed a cruel wizard who tortured your family. You gain the Mage Slayer feat." },
    { "range": [34,34], "text": "You learned to cast Cure Wounds to save a dying elf. You gain the Magic Initiate feat (divine)." },
    { "range": [35,35], "text": "Your warrior mentor died saving your village. You inherited their special weapon and the Martial Adept feat." },
    { "range": [36,36], "text": "You were saved by a mercenary company. Their sergeant's words inspired you, granting the Inspiring Leader feat." },
    { "range": [37,37], "text": "Raiders burned your village. You have proficiency in Stealth and Survival." },
    { "range": [38,38], "text": "You were trapped in the Feywild for a decade. You have proficiency with Deception and Performance." },
    { "range": [39,39], "text": "You alone saw a phoenix. As a bonus action, you can ignite your weapon with fire for 1 minute (1/rest)." },
    { "range": [40,40], "text": "A dwarven armorer taught you a secret. You have a suit of adamantine armor." },
    { "range": [41,41], "text": "You were imprisoned. You have proficiency in Intimidation or Deception and know thieves' cant." },
    { "range": [42,42], "text": "You were an apprentice at a grand library. You gain the Skilled feat and a world-changing secret." },
    { "range": [43,43], "text": "Your family helped medics in a war. You gain the Healer feat and proficiency in Medicine." },
    { "range": [44,44], "text": "A professor gifted you a class-specific item after your parents refused to let you attend college." },
    { "range": [45,45], "text": "You are the child of an archfey. You gain the Fey Touched feat." },
    { "range": [46,46], "text": "An ancient druid taught you their ways. You gain the Wood Elf Magic feat." },
    { "range": [47,47], "text": "You have received exceptional athletic training. You have proficiency (or expertise) in Athletics." },
    { "range": [48,48], "text": "You have spent much of your time around animals. You have proficiency (or expertise) in Animal Handling." },
    { "range": [49,49], "text": "You have studied the mystical arts extensively. You have proficiency (or expertise) in Arcana." },
    { "range": [50,50], "text": "You have received exceptional acrobatic training. You have proficiency (or expertise) in Acrobatics." },
    { "range": [51,51], "text": "You have needed to lie your way out of sticky situations. You have proficiency (or expertise) in Deception." },
    { "range": [52,52], "text": "You have taken a keen interest in history. You have proficiency (or expertise) in History." },
    { "range": [53,53], "text": "Reading people has been important to you. You have proficiency (or expertise) in Insight." },
    { "range": [54,54], "text": "A large scar on your face indicates you've survived tough fights. You have proficiency (or expertise) in Intimidation." },
    { "range": [55,55], "text": "You can put pieces together in difficult situations. You have proficiency (or expertise) in Investigation." },
    { "range": [56,56], "text": "You provided medical aid in times of conflict. You have proficiency (or expertise) in Medicine." },
    { "range": [57,57], "text": "An elder taught you about local flora and fauna. You have proficiency (or expertise) in Nature." },
    { "range": [58,58], "text": "There is little that can pass your keen eye. You have proficiency (or expertise) in Perception." },
    { "range": [59,59], "text": "You were part of a theatre troop. You have proficiency (or expertise) in Performance." },
    { "range": [60,60], "text": "You are a devout follower of an obscure god. You have proficiency (or expertise) in Religion." },
    { "range": [61,61], "text": "You peddled the shell game for cash. You have proficiency (or expertise) in Sleight of Hand." },
    { "range": [62,62], "text": "Shadows seem to stick to you. You have proficiency (or expertise) in Stealth." },
    { "range": [63,63], "text": "You were forced to survive in the wilderness for months. You have proficiency (or expertise) in Survival." },
    { "range": [64,64], "text": "You are always ready for battle. You have proficiency in initiative checks." },
    { "range": [65,65], "text": "You fled an arranged marriage. You start with an additional 1000 gp." },
    { "range": [66,66], "text": "You harbored a fugitive, and your home was destroyed. You have proficiency in Survival and Medicine." },
    { "range": [67,67], "text": "You witnessed a scene of chaos and felt changed. You have the Magic Initiate feat (Dunamancy spell list)." },
    { "range": [68,68], "text": "You stumbled into another world. The chill of that place has yet to leave you. You have the Shadow Touched feat." },
    { "range": [69,69], "text": "A dying woman gave you a rune-covered box to keep safe. You have an Umbra Box." },
    { "range": [70,70], "text": "You awoke as the sole survivor of a fire, bearing burn scars. You may cast Burning Hands 2/day." },
    { "range": [71,71], "text": "Born on the winter solstice, you were gifted by the goddess of winter. You gain the Magic Initiate feat (one cold spell)." },
    { "range": [72,72], "text": "You found a dagger containing the soul of a priest of Nyx. You gain +1 to initiative at night." },
    { "range": [73,73], "text": "You are a foreigner to this world. You can cast Absorb Elements once per long rest." },
    { "range": [74,74], "text": "A government experiment replaced your blood. You have advantage on rolls to disarm, but metal weapons have advantage against you. Movement is reduced by 5 feet." },
    { "range": [75,75], "text": "You were attacked by and contracted a rare form of lycanthropy (work with DM)." },
    { "range": [76,76], "text": "A fairy taught you to sleep more effectively. 3 hours of sleep feels like 6." },
    { "range": [77,77], "text": "A powerful fey found your good deeds annoying. Your eyes change color every time you sleep." }
]
