[
    { "range": [1,1], "text": "Years ago, my best friend gave me a key that glowed with an icy blue light. I never saw that friend again." },
    { "range": [2,2], "text": "I was the only witness to a cold-blooded murder. The killer took a gold coin with a ruby from the victim." },
    { "range": [3,3], "text": "I dreamed an old stranger screamed “Scourger!” at me and then exploded into a column of flame." },
    { "range": [4,4], "text": "I found a cliff with a bunch of caverns dug out of it, large enough for people to hide within." },
    { "range": [5,5], "text": "I followed a cat with a strange sense of purpose to an elder's dwelling; it watched the window for an hour, then fled as if a spell was broken." },
    { "range": [6,6], "text": "One of my parents left in a storm with a sword and shield, returning a week later with the shield in pieces. They never spoke of it." },
    { "range": [7,7], "text": "My farmer friend's crops grew to immense sizes, then the friend and fields vanished. I never heard from them again." },
    { "range": [8,8], "text": "I saw an enormous figure walking through the clouds on a stormy night. It looked at me, and then kept walking." },
    { "range": [9,9], "text": "I woke to a sibling on my chest, saying, “The time is soon.” They have no memory of the event." },
    { "range": [10,10], "text": "I saw a giant bird that cried my name, then disappeared beyond the clouds." },
    { "range": [11,11], "text": "I ate a fruit whose seeds spelled a magic word. Years later, I saw the same word in a slice of bread." },
    { "range": [12,12], "text": "My warrior friend died, but I sometimes see them in their old armor at the corner of my vision." },
    { "range": [13,13], "text": "A seer gave me a vision of a flaming bird chained beneath a mountain, wailing in the darkness." },
    { "range": [14,14], "text": "On a boat, I heard a rumbling voice and saw golden eyes looking up at me from below the water." },
    { "range": [15,15], "text": "While eating, a potato exploded into worms, and I saw a vision of a gigantic worm eating the world." },
    { "range": [16,16], "text": "I saw a tall figure with red skin and horns in a meadow. Flowers grew taller where they walked." },
    { "range": [17,17], "text": "I was saved from wolves by a stranger with bandaged eyes, silver light, scars, and possibly black wings." },
    { "range": [18,18], "text": "I burned myself forging a sword and had a vision of powerful weapons calling for me to wield them." },
    { "range": [19,19], "text": "I met someone fleeing an evil place; they fell dead, and their body vanished before I could return with help." },
    { "range": [20,20], "text": "I caught a falling star. It smiled and told me to look for it on the day when fire erupts from the earth." },
    { "range": [21,21], "text": "I saw a man change into some mound of flesh and ran before I could get a real look." },
    { "range": [22,22], "text": "While fishing, something immense pulled on my line before snapping it." },
    { "range": [23,23], "text": "One foggy morning, I heard a sorrowful song from the river that faded when the sun rose." },
    { "range": [24,24], "text": "A cat as black as midnight spoke to me of dread secrets and hidden courts. I remember its words in my sleep." },
    { "range": [25,25], "text": "I had tea with a beautiful woman in a gazebo in a forest glade. The next day, the glade was filled only with wildflowers." },
    { "range": [26,26], "text": "A finely dressed man came to my door, said he was at the wrong house, smiled too widely, and left." },
    { "range": [27,27], "text": "I saw a coffin whose lid opened slightly, revealing an interior made of nothing but mirrors." },
    { "range": [28,28], "text": "In jail, the rats spoke to me, and I had to treat it as normal." },
    { "range": [29,29], "text": "I reached for a beautiful white flower, cut my hands on unseen thorns, and as I left, it turned red." },
    { "range": [30,30], "text": "In the wind rustling through grain fields, I heard a voice that I can sometimes still faintly hear." },
    { "range": [31,31], "text": "I spent a night with the Cat Prince. Since then, cats obey my commands, though not always gracefully." },
    { "range": [32,32], "text": "My family has served a dwarf clan for generations, and in return for their support, I provided them with information." },
    { "range": [33,33], "text": "I heard a song from a bard that spoke to me deeply. I've searched for it ever since but have found no trace." },
    { "range": [34,34], "text": "I saved a shadowy creature from a grim fate. It now lives inside my own shadow." },
    { "range": [35,35], "text": "I found a sword plunged into an engraved stone in the woods. I pulled it free effortlessly but told no one." },
    { "range": [36,36], "text": "An ancient tree on our family's property was cut down. I found a single acorn and now seek to help it as it helped my family." },
    { "range": [37,37], "text": "I was playing in an abandoned witch's hut and accidentally turned my mom into a frog." },
    { "range": [38,38], "text": "I watched my mom kill my dad. She told me he just left." },
    { "range": [39,39], "text": "I sold out my best friend for 100 gold for a crime I committed. (Gain one rival)." },
    { "range": [40,40], "text": "I've written many books about heroic deeds, none of which I've actually done." },
    { "range": [41,41], "text": "A fortune teller told me the date of my death... It's coming up soon." },
    { "range": [42,42], "text": "My destitute merchant family lost a member to debt collectors as repayment for a bad loan." },
    { "range": [43,43], "text": "I am a foreigner to this world, having fallen through a portal. I can cast Absorb Elements (1/long rest), but it triggers a Wild Magic Surge." },
    { "range": [44,44], "text": "The stars have been screaming my name ever since the dragons returned." },
    { "range": [45,45], "text": "My community considers me a fell omen. My heroics are seen as justifications for a town that is as cold as the void I dream of." },
    { "range": [46,46], "text": "I feel myself slipping between seconds. A school with its name written in Celestial reached out to me." },
    { "range": [47,47], "text": "I sold my soul to a 'friend' for a meal." },
    { "range": [48,48], "text": "The diamond mafia holds my mother's soul hostage." },
    { "range": [49,49], "text": "I found a shield in ancient ruins that sings to me of great purpose, but I do not feel ready." },
    { "range": [50,50], "text": "I am in a death-loop. When I die, I return to an earlier point, but risk losing this power." },
    { "range": [51,51], "text": "I was a potted plant that became a person in a wave of wild magic. I have Nature expertise and salads make me uncomfortable." },
    { "range": [52,52], "text": "I made a deal with a devil and live in fear that they will call to collect." },
    { "range": [53,53], "text": "I gained the Lucky feat from a deal, but each use adds a task to my debt. I start with 3 tasks owed." },
    { "range": [54,54], "text": "I’ve been exiled twice under different names." },
    { "range": [55,55], "text": "Local animals took me in during a storm before a hunter killed them. I do not eat meat." },
    { "range": [56,56], "text": "A giant spider lived near my house. I killed it after it took livestock, and now I fear spiders." },
    { "range": [57,57], "text": "A tree spoke to me, warning 'they were coming'. I always feel they might be right around the corner." },
    { "range": [58,58], "text": "I am next in line to inherit a blood feud, but I am secretly friendly with my counterpart." },
    { "range": [59,59], "text": "I am not the true heir of a powerful family; my servant mother swapped me with the real heir, who was given to a sinister being." },
    { "range": [60,60], "text": "I am the heir of a destitute merchant family, and debt collectors have started to come calling." },
    { "range": [61,61], "text": "I am a sentient weapon inhabiting a 'puppet' body." },
    { "range": [62,62], "text": "A monster slaughtered my traveling companions but left me unharmed after sniffing me." },
    { "range": [63,63], "text": "My twin died because of me, so I took their place. Only one person knows the truth." },
    { "range": [64,64], "text": "I witnessed a marvel that left a mark on me, granting insight into mysteries others cannot understand." },
    { "range": [65,65], "text": "I received a prophecy when I was young, and it has shaped my life ever since." },
    { "range": [66,66], "text": "I discovered my community's faith was false. When I tried to reveal this, I was shunned." },
    { "range": [67,67], "text": "My reflection is another person I can talk to, living in a similar but increasingly different world." },
    { "range": [68,68], "text": "I fell into a chair and woke up in a cave where a sphinx said 'Find Me'." },
    { "range": [69,69], "text": "An old spinster gave me a rabbit that has never aged and sometimes whispers things to me." },
    { "range": [70,70], "text": "It once snowed ash, but I don't know from what." },
    { "range": [71,71], "text": "At a funeral, I saw into Hell and watched Lilith cast a soul into damnation." },
    { "range": [72,72], "text": "I saw a book that made me sick to look at. A priest couldn't burn it and was never the same." },
    { "range": [73,73], "text": "Chairs seem to cause my mother pain." },
    { "range": [74,74], "text": "Alcohol lets me see into the ethereal plane and hear the screams of the lost." },
    { "range": [75,75], "text": "I went to where a star fell and saw a shadow with red eyes leave it, sinking into my soul." },
    { "range": [76,76], "text": "My childhood friend became a wizard, went to college, and came back changed. They died a tenday later." },
    { "range": [77,77], "text": "A stone in my town would sing to me about my future." },
    { "range": [78,78], "text": "A tree was cut down, and I have a +1 dagger made from metal found under it and its wood." },
    { "range": [79,79], "text": "My thumb was crushed by a hammer. A random man healed it and said, 'I will need you later.'" },
    { "range": [80,80], "text": "Lightning struck me, I briefly died, and then was struck again and revived." },
    { "range": [81,81], "text": "I saw a sibling die." },
    { "range": [82,82], "text": "I lost a toe and have no memory of how." },
    { "range": [83,83], "text": "I cannot hear out of my left ear on even days." },
    { "range": [84,84], "text": "I used to climb mountains until I saw my face carved into the stone. I have never hiked again." },
    { "range": [85,85], "text": "Tea makes me sick." },
    { "range": [86,86], "text": "I sometimes speak in tongues (I can speak and understand Draconic)." },
    { "range": [87,87], "text": "I saw Hecate speaking with someone and was so scared I passed out." },
    { "range": [88,88], "text": "When pinched, I smell turnips." },
    { "range": [89,89], "text": "I got lost in a blizzard and saw a maiden who said I would be okay. Snow now feels warm to me (I have cold resistance)." },
    { "range": [90,90], "text": "I get paranoid when underground." },
    { "range": [91,91], "text": "A large bird picked me up as a child and dropped me. I am scared of birds and heights." },
    { "range": [92,92], "text": "As a child, the rain would sing stories to me. I no longer hear them but still enjoy listening." },
    { "range": [93,93], "text": "I wear glasses, and sometimes when I have them on, I see things in the corner of my eye." },
    { "range": [94,94], "text": "I hate reading but can read Arcana easily. I often write in it by mistake." },
    { "range": [95,95], "text": "I beat someone in chess, and they died an hour later." },
    { "range": [96,96], "text": "When I sleep, I am in a black void where I can see doors appear." },
    { "range": [97,97], "text": "When I sleep, I am in a yellow mist void where I hear millions of voices working for the same thing." },
    { "range": [98,98], "text": "When I sleep, I am in a white mist void where I can hear some of the prayers of people to good gods." },
    { "range": [99,99], "text": "I have a letter of recommendation from a High Proxy because I was a nice kid to one of them." },
    { "range": [100,100], "text": "I worked for the government on Wolgari, being pushed from job to job. I know too much." }
]
